output/test1.txt
5 seconds, just initConnection  

     checks.........................: 100.00% ✓ 2229        ✗ 0
     data_received..................: 2.1 MB  429 kB/s
     data_sent......................: 1.7 MB  342 kB/s
     http_req_blocked...............: avg=2.54µs   min=874ns    med=2.01µs   max=232.8µs  p(90)=3.84µs   p(95)=4.97µs
     http_req_connecting............: avg=17ns     min=0s       med=0s       max=116.58µs p(90)=0s       p(95)=0s
     http_req_duration..............: avg=293.74µs min=95.17µs  med=245.38µs max=14.95ms  p(90)=430.95µs p(95)=539.68µs
       { expected_response:true }...: avg=293.74µs min=95.17µs  med=245.38µs max=14.95ms  p(90)=430.95µs p(95)=539.68µs
     http_req_failed................: 0.00%   ✓ 0           ✗ 6687
     http_req_receiving.............: avg=41.15µs  min=14.1µs   med=37.01µs  max=475.59µs p(90)=59.86µs  p(95)=72.61µs
     http_req_sending...............: avg=12.86µs  min=4.47µs   med=11.96µs  max=166.22µs p(90)=18.52µs  p(95)=22.99µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=239.72µs min=70.64µs  med=194.85µs max=14.61ms  p(90)=364.32µs p(95)=456.55µs
     http_reqs......................: 6687    1337.259128/s
     iteration_duration.............: avg=2.23ms   min=1.37ms   med=1.9ms    max=23.9ms   p(90)=2.88ms   p(95)=3.73ms
     iterations.....................: 2229    445.753043/s
     vus............................: 1       min=1         max=1
     vus_max........................: 1       min=1         max=1
     ws_connecting..................: avg=521.93µs min=280.71µs med=455.45µs max=15.93ms  p(90)=648.01µs p(95)=825.31µs
     ws_msgs_sent...................: 2229    445.753043/s
     ws_session_duration............: avg=941.01µs min=535.72µs med=817.09µs max=20.27ms  p(90)=1.14ms   p(95)=1.52ms
     ws_sessions....................: 2229    445.753043/s